n5/src/Catalogs/Series/Series.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Series</name>
  <owners>Catalog.Items</owners>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.Countries</types>
    </type>
  </attributes>
  <attributes>
    <name>ExpirationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpirationPeriod</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Lot</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Produced</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Catalogs/Series/ObjectModule.bsl
Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not ( checkDates ()
		and checkDoubles () ) ) then
		Cancel = true;
	endif;
	
EndProcedure

Function checkDates  ()
	
	if ( Periods.Ok ( Produced, ExpirationDate ) ) then
		return true;
	endif;
	Output.PeriodError ( , "ExpirationDate" );
	return false;
	
EndFunction

Function checkDoubles ()
	
	if ( IsInRole ( Metadata.Roles.DoublesAllowed ) ) then
		return true;
	endif; 
	SetPrivilegedMode ( true );
	original = DF.GetOriginal ( Ref, "Lot", Lot, Owner );
	if ( original = undefined ) then
		return true;
	endif; 
	Output.ObjectNotOriginal ( new Structure ( "Value", Lot ), "Lot" );
	return false;
	
EndFunction
